#if 0
;
; Note: shader requires additional functionality:
;       UAVs at every shader stage
;
; shader debug name: e7dd2d64dda2c900c1cdcf6bd1ba7da6.pdb
; shader hash: e7dd2d64dda2c900c1cdcf6bd1ba7da6
;
; Buffer Definitions:
;
;
; Resource Bindings:
;
; Name                                 Type  Format         Dim      ID      HLSL Bind  Count
; ------------------------------ ---------- ------- ----------- ------- -------------- ------
; gRtScene                          texture     i32         ras      T0             t0     1
; gOutput                               UAV     f32          2d      U0             u0     1
;
target datalayout = "e-m:e-p:32:32-i1:32-i8:32-i16:32-i32:32-i64:64-f16:32-f32:32-f64:64-n8:16:32:64"
target triple = "dxil-ms-dx"

%struct.RaytracingAccelerationStructure = type { i32 }
%"class.RWTexture2D<vector<float, 4> >" = type { <4 x float> }
%struct.RayPayload = type { <3 x float> }
%struct.RayDesc = type { <3 x float>, float, <3 x float>, float }
%dx.types.Handle = type { i8* }
%struct.BuiltInTriangleIntersectionAttributes = type { <2 x float> }

@"\01?gRtScene@@3URaytracingAccelerationStructure@@A" = external constant %struct.RaytracingAccelerationStructure, align 4
@"\01?gOutput@@3V?$RWTexture2D@V?$vector@M$03@@@@A" = external constant %"class.RWTexture2D<vector<float, 4> >", align 4

; Function Attrs: nounwind readnone
declare void @llvm.dbg.declare(metadata, metadata, metadata) #0

; Function Attrs: nounwind

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxc 1.2", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !31, globals: !52)
!1 = !DIFile(filename: "Shader\5CShader\5CDxrShader.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !14, !22}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 24, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 24, size: 64, align: 32, elements: !6, templateParams: !10)
!6 = !{!7, !9}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 24, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 24, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !{!11, !12}
!11 = !DITemplateTypeParameter(name: "element", type: !8)
!12 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 2)
!13 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, baseType: !15)
!15 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, size: 96, align: 32, elements: !16, templateParams: !20)
!16 = !{!17, !18, !19}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !15, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !15, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !15, file: !1, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!20 = !{!11, !21}
!21 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 3)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 40, baseType: !23)
!23 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 40, size: 128, align: 32, elements: !24, templateParams: !29)
!24 = !{!25, !26, !27, !28}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !23, file: !1, line: 40, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !23, file: !1, line: 40, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !23, file: !1, line: 40, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !23, file: !1, line: 40, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!29 = !{!11, !30}
!30 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 4)
!31 = !{!32, !36, !39, !46}
!32 = !DISubprogram(name: "linearToSrgb", linkageName: "\01?linearToSrgb@@YA?AV?$vector@M$02@@V1@@Z", scope: !33, file: !33, line: 8, type: !34, isLocal: false, isDefinition: true, scopeLine: 9, flags: DIFlagPrototyped, isOptimized: false)
!33 = !DIFile(filename: "Shader\5CDxrShader.hlsl", directory: "")
!34 = !DISubroutineType(types: !35)
!35 = !{!14, !14}
!36 = !DISubprogram(name: "RayGenerationShader", linkageName: "\01?RayGenerationShader@@YAXXZ", scope: !33, file: !33, line: 19, type: !37, isLocal: false, isDefinition: true, scopeLine: 20, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @"\01?RayGenerationShader@@YAXXZ")
!37 = !DISubroutineType(types: !38)
!38 = !{null}
!39 = !DISubprogram(name: "MissShader", linkageName: "\01?MissShader@@YAXURayPayload@@@Z", scope: !33, file: !33, line: 44, type: !40, isLocal: false, isDefinition: true, scopeLine: 45, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.RayPayload*)* @"\01?MissShader@@YAXURayPayload@@@Z")
!40 = !DISubroutineType(types: !41)
!41 = !{null, !42}
!42 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !43)
!43 = !DICompositeType(tag: DW_TAG_structure_type, name: "RayPayload", file: !33, line: 4, size: 96, align: 32, elements: !44)
!44 = !{!45}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !43, file: !33, line: 5, baseType: !14, size: 96, align: 32)
!46 = !DISubprogram(name: "ClosestHitShader", linkageName: "\01?ClosestHitShader@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", scope: !33, file: !33, line: 50, type: !47, isLocal: false, isDefinition: true, scopeLine: 51, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ClosestHitShader@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z")
!47 = !DISubroutineType(types: !48)
!48 = !{null, !42, !49}
!49 = !DICompositeType(tag: DW_TAG_structure_type, name: "BuiltInTriangleIntersectionAttributes", file: !1, line: 47, size: 64, align: 32, elements: !50)
!50 = !{!51}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "barycentrics", scope: !49, file: !1, line: 47, baseType: !5, size: 64, align: 32)
!52 = !{!53, !55, !56, !57, !59, !63, !65, !67, !69, !70, !71, !72, !73, !74}
!53 = !DIGlobalVariable(name: "A", scope: !46, file: !33, line: 54, type: !54, isLocal: true, isDefinition: true)
!54 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !14)
!55 = !DIGlobalVariable(name: "B", scope: !46, file: !33, line: 55, type: !54, isLocal: true, isDefinition: true)
!56 = !DIGlobalVariable(name: "C", scope: !46, file: !33, line: 56, type: !54, isLocal: true, isDefinition: true)
!57 = !DIGlobalVariable(name: "gRtScene", linkageName: "\01?gRtScene@@3URaytracingAccelerationStructure@@A", scope: !0, file: !33, line: 1, type: !58, isLocal: false, isDefinition: true, variable: %struct.RaytracingAccelerationStructure* @"\01?gRtScene@@3URaytracingAccelerationStructure@@A")
!58 = !DICompositeType(tag: DW_TAG_structure_type, name: "RaytracingAccelerationStructure", file: !1, line: 1, size: 32, align: 32, elements: !2)
!59 = !DIGlobalVariable(name: "gOutput", linkageName: "\01?gOutput@@3V?$RWTexture2D@V?$vector@M$03@@@@A", scope: !0, file: !33, line: 2, type: !60, isLocal: false, isDefinition: true, variable: %"class.RWTexture2D<vector<float, 4> >"* @"\01?gOutput@@3V?$RWTexture2D@V?$vector@M$03@@@@A")
!60 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2D<vector<float, 4> >", file: !1, line: 2, size: 128, align: 32, elements: !2, templateParams: !61)
!61 = !{!62}
!62 = !DITemplateTypeParameter(name: "element", type: !23)
!63 = !DIGlobalVariable(name: "A.0", linkageName: "\01?A@?1??ClosestHitShader@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z@3V?$vector@M$02@@B.0", scope: !46, file: !33, line: 54, type: !64, isLocal: false, isDefinition: true)
!64 = !DIDerivedType(tag: DW_TAG_member, name: ".0", baseType: !54, size: 32, align: 4)
!65 = !DIGlobalVariable(name: "A.1", linkageName: "\01?A@?1??ClosestHitShader@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z@3V?$vector@M$02@@B.1", scope: !46, file: !33, line: 54, type: !66, isLocal: false, isDefinition: true)
!66 = !DIDerivedType(tag: DW_TAG_member, name: ".1", baseType: !54, size: 32, align: 4, offset: 32)
!67 = !DIGlobalVariable(name: "A.2", linkageName: "\01?A@?1??ClosestHitShader@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z@3V?$vector@M$02@@B.2", scope: !46, file: !33, line: 54, type: !68, isLocal: false, isDefinition: true)
!68 = !DIDerivedType(tag: DW_TAG_member, name: ".2", baseType: !54, size: 32, align: 4, offset: 64)
!69 = !DIGlobalVariable(name: "B.0", linkageName: "\01?B@?1??ClosestHitShader@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z@3V?$vector@M$02@@B.0", scope: !46, file: !33, line: 55, type: !64, isLocal: false, isDefinition: true)
!70 = !DIGlobalVariable(name: "B.1", linkageName: "\01?B@?1??ClosestHitShader@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z@3V?$vector@M$02@@B.1", scope: !46, file: !33, line: 55, type: !66, isLocal: false, isDefinition: true)
!71 = !DIGlobalVariable(name: "B.2", linkageName: "\01?B@?1??ClosestHitShader@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z@3V?$vector@M$02@@B.2", scope: !46, file: !33, line: 55, type: !68, isLocal: false, isDefinition: true)
!72 = !DIGlobalVariable(name: "C.0", linkageName: "\01?C@?1??ClosestHitShader@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z@3V?$vector@M$02@@B.0", scope: !46, file: !33, line: 56, type: !64, isLocal: false, isDefinition: true)
!73 = !DIGlobalVariable(name: "C.1", linkageName: "\01?C@?1??ClosestHitShader@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z@3V?$vector@M$02@@B.1", scope: !46, file: !33, line: 56, type: !66, isLocal: false, isDefinition: true)
!74 = !DIGlobalVariable(name: "C.2", linkageName: "\01?C@?1??ClosestHitShader@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z@3V?$vector@M$02@@B.2", scope: !46, file: !33, line: 56, type: !68, isLocal: false, isDefinition: true)
!75 = !{i32 2, !"Dwarf Version", i32 4}
!76 = !{i32 2, !"Debug Info Version", i32 3}
!77 = !{!"dxc 1.2"}
!78 = !{!"Shader\5CDxrShader.hlsl", !"RaytracingAccelerationStructure gRtScene : register(t0);\0D\0ARWTexture2D<float4> gOutput : register(u0);\0D\0A\0D\0Astruct RayPayload {\0D\0A    float3 color;\0D\0A};\0D\0A\0D\0Afloat3 linearToSrgb(float3 c)\0D\0A{\0D\0A    // Based on http://chilliant.blogspot.com/2012/08/srgb-approximations-for-hlsl.html\0D\0A    float3 sq1 = sqrt(c);\0D\0A    float3 sq2 = sqrt(sq1);\0D\0A    float3 sq3 = sqrt(sq2);\0D\0A    float3 srgb = 0.662002687 * sq1 + 0.684122060 * sq2 - 0.323583601 * sq3 - 0.0225411470 * c;\0D\0A    return srgb;\0D\0A}\0D\0A\0D\0A[shader(\22raygeneration\22)]\0D\0Avoid RayGenerationShader()\0D\0A{\0D\0A    uint3 launchIndex = DispatchRaysIndex();\0D\0A    uint3 launchDim = DispatchRaysDimensions();\0D\0A\0D\0A    float2 crd = float2(launchIndex.xy);\0D\0A    float2 dims = float2(launchDim.xy);\0D\0A\0D\0A    float2 d = ((crd / dims) * 2.f - 1.f);\0D\0A    float aspectRatio = dims.x / dims.y;\0D\0A\0D\0A    RayDesc ray;\0D\0A    ray.Origin = float3(0, 0, -2);\0D\0A    ray.Direction = normalize(float3(d.x * aspectRatio, -d.y, 1));\0D\0A\0D\0A    ray.TMin = 0;\0D\0A    ray.TMax = 100000;\0D\0A\0D\0A    RayPayload payload;\0D\0A    TraceRay(gRtScene, 0 /*rayFlags*/, 0xFF, 0 /* ray index*/, 0, 0, ray, payload);\0D\0A    float3 col = linearToSrgb(payload.color);\0D\0A    gOutput[launchIndex.xy] = float4(col, 1);\0D\0A}\0D\0A\0D\0A[shader(\22miss\22)]\0D\0Avoid MissShader(inout RayPayload payload)\0D\0A{\0D\0A    payload.color = float3(0, 0, 0);\0D\0A}\0D\0A\0D\0A[shader(\22closesthit\22)]\0D\0Avoid ClosestHitShader(inout RayPayload payload, in BuiltInTriangleIntersectionAttributes attribs)\0D\0A{\0D\0A    float3 barycentrics = float3(1.0 - attribs.barycentrics.x - attribs.barycentrics.y, attribs.barycentrics.x, attribs.barycentrics.y);\0D\0A\0D\0A    const float3 A = float3(1, 0, 0);\0D\0A    const float3 B = float3(0, 1, 0);\0D\0A    const float3 C = float3(0, 0, 1);\0D\0A\0D\0A    payload.color = A * barycentrics.x + B * barycentrics.y + C * barycentrics.z;\0D\0A}\0D\0A"}
!79 = !{!"Shader\5CDxrShader.hlsl"}
!80 = !{!"/T", !"lib_6_5", !"/Fo", !"C:\5CUsers\5Cgl\5CDocuments\5Csource\5Cdx\5CUWP-DXR\5CBuildOut\5Cx64\5CDebug\5CUWP-DXR\5CDxrShader.cso", !"/Od", !"/Zi"}
!81 = !{i32 1, i32 5}
!82 = !{!"lib", i32 6, i32 5}
!83 = !{!84, !87, null, null}
!84 = !{!85}
!85 = !{i32 0, %struct.RaytracingAccelerationStructure* @"\01?gRtScene@@3URaytracingAccelerationStructure@@A", !"gRtScene", i32 0, i32 0, i32 1, i32 16, i32 0, !86}
!86 = !{i32 0, i32 4}
!87 = !{!88}
!88 = !{i32 0, %"class.RWTexture2D<vector<float, 4> >"* @"\01?gOutput@@3V?$RWTexture2D@V?$vector@M$03@@@@A", !"gOutput", i32 0, i32 0, i32 1, i32 2, i1 false, i1 false, i1 false, !89}
!89 = !{i32 0, i32 9}
!90 = !{i32 0, %struct.RaytracingAccelerationStructure undef, !91, %"class.RWTexture2D<vector<float, 4> >" undef, !93, %struct.RayDesc undef, !98, %struct.RayPayload undef, !103, %struct.BuiltInTriangleIntersectionAttributes undef, !105}
!91 = !{i32 4, !92}
!92 = !{i32 6, !"h", i32 3, i32 0, i32 7, i32 4}
!93 = !{i32 16, !94, !95}
!94 = !{i32 6, !"h", i32 3, i32 0, i32 7, i32 9}
!95 = !{i32 0, !96}
!96 = !{!97}
!97 = !{i32 0, <4 x float> undef}
!98 = !{i32 32, !99, !100, !101, !102}
!99 = !{i32 6, !"Origin", i32 3, i32 0, i32 7, i32 9}
!100 = !{i32 6, !"TMin", i32 3, i32 12, i32 7, i32 9}
!101 = !{i32 6, !"Direction", i32 3, i32 16, i32 7, i32 9}
!102 = !{i32 6, !"TMax", i32 3, i32 28, i32 7, i32 9}
!103 = !{i32 12, !104}
!104 = !{i32 6, !"color", i32 3, i32 0, i32 7, i32 9}
!105 = !{i32 8, !106}
!106 = !{i32 6, !"barycentrics", i32 3, i32 0, i32 7, i32 9}
!107 = !{i32 1, void ()* @"\01?RayGenerationShader@@YAXXZ", !108, void (%struct.RayPayload*)* @"\01?MissShader@@YAXURayPayload@@@Z", !110, void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ClosestHitShader@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", !112}
!108 = !{!109}
!109 = !{i32 1, !2, !2}
!110 = !{!109, !111}
!111 = !{i32 2, !2, !2}
!112 = !{!109, !111, !113}
!113 = !{i32 0, !2, !2}
!114 = !{null, !"", null, !83, !115}
!115 = !{i32 0, i64 65537}
!116 = !{void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ClosestHitShader@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", !"\01?ClosestHitShader@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", null, null, !117}
!117 = !{i32 8, i32 10, i32 6, i32 12, i32 7, i32 8, i32 5, !118}
!118 = !{i32 0}
!119 = !{void (%struct.RayPayload*)* @"\01?MissShader@@YAXURayPayload@@@Z", !"\01?MissShader@@YAXURayPayload@@@Z", null, null, !120}
!120 = !{i32 8, i32 11, i32 6, i32 12, i32 5, !118}
!121 = !{void ()* @"\01?RayGenerationShader@@YAXXZ", !"\01?RayGenerationShader@@YAXXZ", null, null, !122}
!122 = !{i32 8, i32 7, i32 5, !118}
!123 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "launchIndex", scope: !36, file: !33, line: 21, type: !124)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, line: 21, baseType: !125)
!125 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, line: 21, size: 96, align: 32, elements: !126, templateParams: !131)
!126 = !{!127, !129, !130}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !125, file: !1, line: 21, baseType: !128, size: 32, align: 32, flags: DIFlagPublic)
!128 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !125, file: !1, line: 21, baseType: !128, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !125, file: !1, line: 21, baseType: !128, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!131 = !{!132, !21}
!132 = !DITemplateTypeParameter(name: "element", type: !128)
!133 = !DIExpression()
!134 = !DILocation(line: 21, column: 11, scope: !36)
!135 = !DILocation(line: 21, column: 25, scope: !36)
!136 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "launchDim", scope: !36, file: !33, line: 22, type: !124)
!137 = !DILocation(line: 22, column: 11, scope: !36)
!138 = !DILocation(line: 22, column: 23, scope: !36)
!139 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "crd", scope: !36, file: !33, line: 24, type: !4)
!140 = !DILocation(line: 24, column: 12, scope: !36)
!141 = !DILocation(line: 24, column: 25, scope: !36)
!142 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dims", scope: !36, file: !33, line: 25, type: !4)
!143 = !DILocation(line: 25, column: 12, scope: !36)
!144 = !DILocation(line: 25, column: 26, scope: !36)
!145 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "d", scope: !36, file: !33, line: 27, type: !4)
!146 = !DILocation(line: 27, column: 12, scope: !36)
!147 = !DILocation(line: 27, column: 18, scope: !36)
!148 = !DILocation(line: 27, column: 24, scope: !36)
!149 = !DILocation(line: 27, column: 22, scope: !36)
!150 = !DILocation(line: 27, column: 30, scope: !36)
!151 = !DILocation(line: 27, column: 36, scope: !36)
!152 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "aspectRatio", scope: !36, file: !33, line: 28, type: !8)
!153 = !DILocation(line: 28, column: 11, scope: !36)
!154 = !DILocation(line: 28, column: 25, scope: !36)
!155 = !DILocation(line: 28, column: 34, scope: !36)
!156 = !DILocation(line: 28, column: 32, scope: !36)
!157 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ray", scope: !36, file: !33, line: 30, type: !158)
!158 = !DICompositeType(tag: DW_TAG_structure_type, name: "RayDesc", file: !1, line: 30, size: 256, align: 32, elements: !159)
!159 = !{!160, !161, !162, !163}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "Origin", scope: !158, file: !1, line: 30, baseType: !15, size: 96, align: 32)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "TMin", scope: !158, file: !1, line: 30, baseType: !8, size: 32, align: 32, offset: 96)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "Direction", scope: !158, file: !1, line: 30, baseType: !15, size: 96, align: 32, offset: 128)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "TMax", scope: !158, file: !1, line: 30, baseType: !8, size: 32, align: 32, offset: 224)
!164 = !DILocation(line: 30, column: 13, scope: !36)
!165 = !DILocation(line: 31, column: 9, scope: !36)
!166 = !DILocation(line: 31, column: 16, scope: !36)
!167 = !DILocation(line: 32, column: 38, scope: !36)
!168 = !DILocation(line: 32, column: 44, scope: !36)
!169 = !DILocation(line: 32, column: 42, scope: !36)
!170 = !DILocation(line: 32, column: 58, scope: !36)
!171 = !DILocation(line: 32, column: 57, scope: !36)
!172 = !DILocation(line: 32, column: 21, scope: !36)
!173 = !DILocation(line: 32, column: 9, scope: !36)
!174 = !DILocation(line: 32, column: 19, scope: !36)
!175 = !DILocation(line: 34, column: 9, scope: !36)
!176 = !DILocation(line: 34, column: 14, scope: !36)
!177 = !DILocation(line: 35, column: 9, scope: !36)
!178 = !DILocation(line: 35, column: 14, scope: !36)
!179 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "payload", scope: !36, file: !33, line: 37, type: !43)
!180 = !DILocation(line: 37, column: 16, scope: !36)
!181 = !DILocation(line: 38, column: 5, scope: !36)
!182 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "col", scope: !36, file: !33, line: 39, type: !14)
!183 = !DILocation(line: 39, column: 12, scope: !36)
!184 = !DILocation(line: 39, column: 39, scope: !36)
!185 = !DILocation(line: 39, column: 18, scope: !36)
!186 = !DILocation(line: 11, column: 23, scope: !32, inlinedAt: !187)
!187 = distinct !DILocation(line: 39, column: 18, scope: !36)
!188 = !DILocation(line: 11, column: 18, scope: !32, inlinedAt: !187)
!189 = !DILocation(line: 11, column: 12, scope: !32, inlinedAt: !187)
!190 = !DILocation(line: 12, column: 23, scope: !32, inlinedAt: !187)
!191 = !DILocation(line: 12, column: 18, scope: !32, inlinedAt: !187)
!192 = !DILocation(line: 12, column: 12, scope: !32, inlinedAt: !187)
!193 = !DILocation(line: 13, column: 23, scope: !32, inlinedAt: !187)
!194 = !DILocation(line: 13, column: 18, scope: !32, inlinedAt: !187)
!195 = !DILocation(line: 13, column: 12, scope: !32, inlinedAt: !187)
!196 = !DILocation(line: 14, column: 33, scope: !32, inlinedAt: !187)
!197 = !DILocation(line: 14, column: 31, scope: !32, inlinedAt: !187)
!198 = !DILocation(line: 14, column: 53, scope: !32, inlinedAt: !187)
!199 = !DILocation(line: 14, column: 51, scope: !32, inlinedAt: !187)
!200 = !DILocation(line: 14, column: 37, scope: !32, inlinedAt: !187)
!201 = !DILocation(line: 14, column: 73, scope: !32, inlinedAt: !187)
!202 = !DILocation(line: 14, column: 71, scope: !32, inlinedAt: !187)
!203 = !DILocation(line: 14, column: 57, scope: !32, inlinedAt: !187)
!204 = !DILocation(line: 14, column: 94, scope: !32, inlinedAt: !187)
!205 = !DILocation(line: 14, column: 92, scope: !32, inlinedAt: !187)
!206 = !DILocation(line: 14, column: 77, scope: !32, inlinedAt: !187)
!207 = !DILocation(line: 14, column: 12, scope: !32, inlinedAt: !187)
!208 = !DILocation(line: 15, column: 12, scope: !32, inlinedAt: !187)
!209 = !DILocation(line: 15, column: 5, scope: !32, inlinedAt: !187)
!210 = !DILocation(line: 40, column: 38, scope: !36)
!211 = !DILocation(line: 40, column: 13, scope: !36)
!212 = !DILocation(line: 40, column: 5, scope: !36)
!213 = !DILocation(line: 40, column: 29, scope: !36)
!214 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "c", arg: 1, scope: !32, file: !33, line: 8, type: !14)
!215 = !DILocation(line: 8, column: 28, scope: !32, inlinedAt: !187)
!216 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sq1", scope: !32, file: !33, line: 11, type: !14)
!217 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sq2", scope: !32, file: !33, line: 12, type: !14)
!218 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sq3", scope: !32, file: !33, line: 13, type: !14)
!219 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "srgb", scope: !32, file: !33, line: 14, type: !14)
!220 = !DILocation(line: 41, column: 1, scope: !36)
!221 = !DILocation(line: 44, column: 34, scope: !39)
